/**
 * Cоздайте метод, который будет считывать сколько денег получает работник в неделю. Метод должен принимать на
 * входе два аргумента(зарплата в час, кол-во проработанных часов).
 * Условия:
 * 1. Кажлый час после 40 считается за полтора.
 * 2. Работник не может работать больше, чем 60 часов в неделю.
 * 3 Работник не может получать менбше 8 долларов в час.
 */
public class Work_5 {
    public static void main (String[] args){

    }
}
class Worker{
    private int salaryWorker;
    private int countHour;

}