package l0806.Task_3;
/*Ключи и замки
    Разработать приложение, реализующее ключи и замки.
    Замки должны быть двух видов: кодовые (которые открываются с помощью числового кода) и механические
    (которые открываются с помощью физического ключа). При попытке ввода неправильноо кода или попытке вствить в замок
    что-то , кроме ключа, выводится соответствующее значение.
    Ключи могут открывать замок, только если борозды в них совпадают(реализация на ваше усматрение, например, может быть
      массив чисел типа [1,2,3,4].
    Характеристики ключей и замков устанавливаются производителем.
* */
public class Task_3 {
}
